### TASK - Raw data to Clean data 

This project involves cleaning and processing address and timestamp data. The address field in the dataset is split into individual components (House Address, Street, City, State, Zip), and the timestamp is broken down into Month, Date, Year, Hour, Minutes, and Seconds. The cleaned data is then exported to an Excel file for further analysis.

In [2]:
import pandas as pd

In [29]:
rd = pd.read_excel(r'Downloads\Raw data.xlsx')
rd # raw data

                                          ADDR         DT NAME     time
0  45 rd, kenith street, btm, bangalore 500038 2022-04-03  abc  8:30:21
1            45 rd,  street, hitech, Hd 500038 2022-04-02  dec  5:30:21

In [33]:
rd.columns

Index(['ADDR', 'DT', 'NAME', 'time'], dtype='object')

In [35]:
rd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ADDR    2 non-null      object
 1   DT      2 non-null      datetime64[ns]
 2   NAME    2 non-null      object
 3   time    2 non-null      object
dtypes: datetime64[ns](1), object(3)
memory usage: 196.0+ bytes

In [5]:
rd.isna()

    ADDR     DT   NAME   time
0  False  False  False  False
1  False  False  False  False

In [6]:
rd.isnull().sum()

ADDR    0
DT      0
NAME    0
time    0
dtype: int64

In [7]:
#Step 1 Clean the Address Column split it in to House Addr,Street,City,State_Zip

rd[['Houseadd','Street','City','State_Zip']] = rd['ADDR'].str.split(',',expand = True)
rd

,ADDR,DT,NAME,time,Houseadd,Street,City,State_Zip
0,"45 rd, kenith street, btm, bangalore 500038",2022-04-03,abc,8:30:21,45 rd,kenith street,btm,bangalore 500038
1,"45 rd, street, hitech, Hd 500038",2022-04-02,dec,5:30:21,45 rd,street,hitech,Hd 500038

In [8]:
#Step2 as State Zip is not comma seperated we need to split based on Space

rd['State_Zip'] = rd['State_Zip'].str.strip()
rd[['State','Zip']] = rd['State_Zip'].str.split(' ',expand = True)
rd

,ADDR,DT,NAME,time,Houseadd,Street,City,State_Zip,State,Zip
0,"45 rd, kenith street, btm, bangalore 500038",2022-04-03,abc,8:30:21,45 rd,kenith street,btm,bangalore 500038,bangalore,500038
1,"45 rd, street, hitech, Hd 500038",2022-04-02,dec,5:30:21,45 rd,street,hitech,Hd 500038,Hd,500038

In [9]:
#Step 3 to split the date column in to Year month Date

rd['DT'] = rd['DT'].astype(str)
rd[['Year','Month','Date']] = rd['DT'].str.split('-',expand = True)
rd

,ADDR,DT,NAME,time,Houseadd,Street,City,State_Zip,State,Zip,Year,Month,Date
0,"45 rd, kenith street, btm, bangalore 500038",2022-04-03,abc,8:30:21,45 rd,kenith street,btm,bangalore 500038,bangalore,500038,2022,04,03
1,"45 rd, street, hitech, Hd 500038",2022-04-02,dec,5:30:21,45 rd,street,hitech,Hd 500038,Hd,500038,2022,04,02

In [10]:
#Step 4 to split the time column in to Hour Minutes and Seconds

rd[['Hour','Minutes', 'Seconds']] = rd['time'].str.split(':',expand=True)
rd

,ADDR,DT,NAME,time,Houseadd,Street,City,State_Zip,State,Zip,Year,Month,Date,Hour,Minutes,Seconds
0,"45 rd, kenith street, btm, bangalore 500038",2022-04-03,abc,8:30:21,45 rd,kenith street,btm,bangalore 500038,bangalore,500038,2022,04,03,8,30,21
1,"45 rd, street, hitech, Hd 500038",2022-04-02,dec,5:30:21,45 rd,street,hitech,Hd 500038,Hd,500038,2022,04,02,5,30,21

In [11]:
#Delete the Raw / Old Columns from the Dataframe object

rd = rd.drop(['ADDR', 'DT','time','State_Zip'], axis=1)
rd

,NAME,Houseadd,Street,City,State,Zip,Year,Month,Date,Hour,Minutes,Seconds
0,abc,45 rd,kenith street,btm,bangalore,500038,2022,04,03,8,30,21
1,dec,45 rd,street,hitech,Hd,500038,2022,04,02,5,30,21

In [23]:
#export the excelDataFrame object to Clean excel Data
# Arranged the header and exported the columns based on cleanData output files

rd[['Houseadd','Street','City','State','Zip','Month','Date',
'Year','NAME','Hour','Minutes','Seconds']].to_excel(r"Downloads\CleanData.xlsx")

In [ ]:
# the end #